Revit 2024 API
PlanCircuitSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual PlanCircuitSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As PlanCircuitSetIterator
Visual C++
public:
virtual PlanCircuitSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
PlanCircuitSet Class
Autodesk.Revit.DB Namespace